#+PROPERTY: header-args:python :exports code :eval no
#+PROPERTY: header-args:R :exports code :eval no
* PyTorch

- So I managed to get around 10K worth of images.
- This is good enough to start testing with.
- I plan to use PyTorch, as it appears to work with my GPU and because I liked Torch's syntax.

#+BEGIN_SRC python :session
import torch as th
import torchvision as tv
#+END_SRC
- This works, indicating that the packages are installed.

- Tensors are like ndarrays (which are like matrices)

- They can be used on GPUs to accelerate computation

#+BEGIN_SRC python :session
x = th.Tensor(5, 3)
print(x)
#+END_SRC

#+RESULTS:

- Random tensor

#+BEGIN_SRC python :session :results output
y = th.rand(5, 3)
print(y)
#+END_SRC

#+RESULTS:
:
: 0.7230  0.6188  0.2749
:  0.0346  0.8760  0.8594
:  0.3078  0.8875  0.3584
:  0.8441  0.3608  0.9202
:  0.1699  0.1945  0.2956
: [torch.FloatTensor of size 5x3]

#+BEGIN_SRC python :session :results output
print(y.size())

#+END_SRC

#+RESULTS:
: torch.Size([5, 3])

#+BEGIN_SRC python :session :results output
print(x+y)
#+END_SRC

#+RESULTS:
: -1.7168e+17  6.1880e-01  2.7489e-01
:  3.4601e-02  8.7604e-01  8.5941e-01
:  3.0783e-01  8.8750e-01  3.5845e-01
:  8.4413e-01  3.6083e-01  9.2018e-01
:  1.6988e-01  1.9452e-01  2.9561e-01
: [torch.FloatTensor of size 5x3]

#+BEGIN_SRC python :session :results output
print(th.add(x, y))
#+END_SRC

#+RESULTS:
: -1.7168e+17  6.1880e-01  2.7489e-01
:  3.4601e-02  8.7604e-01  8.5941e-01
:  3.0783e-01  8.8750e-01  3.5845e-01
:  8.4413e-01  3.6083e-01  9.2018e-01
:  1.6988e-01  1.9452e-01  2.9561e-01
: [torch.FloatTensor of size 5x3]

- We can assign an output tensor for the result
#+BEGIN_SRC python :session :results output
result = th.Tensor(5, 3)
th.add(x, y, out=result)
print(result)
#+END_SRC

#+RESULTS:
#+begin_example

-1.7168e+17  6.1880e-01  2.7489e-01
 3.4601e-02  8.7604e-01  8.5941e-01
 3.0783e-01  8.8750e-01  3.5845e-01
 8.4413e-01  3.6083e-01  9.2018e-01
 1.6988e-01  1.9452e-01  2.9561e-01
[torch.FloatTensor of size 5x3]
-1.7168e+17  6.1880e-01  2.7489e-01
 3.4601e-02  8.7604e-01  8.5941e-01
 3.0783e-01  8.8750e-01  3.5845e-01
 8.4413e-01  3.6083e-01  9.2018e-01
 1.6988e-01  1.9452e-01  2.9561e-01
[torch.FloatTensor of size 5x3]
#+end_example

We can also do in-place addition

#+BEGIN_SRC python :session :results output
y.add_(x)
print(y)
#+END_SRC

#+RESULTS:
#+begin_example
-1.7168e+17  6.1880e-01  2.7489e-01
 3.4601e-02  8.7604e-01  8.5941e-01
 3.0783e-01  8.8750e-01  3.5845e-01
 8.4413e-01  3.6083e-01  9.2018e-01
 1.6988e-01  1.9452e-01  2.9561e-01
[torch.FloatTensor of size 5x3]
-1.7168e+17  6.1880e-01  2.7489e-01
 3.4601e-02  8.7604e-01  8.5941e-01
 3.0783e-01  8.8750e-01  3.5845e-01
 8.4413e-01  3.6083e-01  9.2018e-01
 1.6988e-01  1.9452e-01  2.9561e-01
[torch.FloatTensor of size 5x3]
#+end_example

- In place ops are designated with an underscore.

- Standard numpy indexing

#+BEGIN_SRC python :session :results output
print(x[:,1])
#+END_SRC

#+RESULTS:
: 1.00000e-41 *
:   4.5736
:   0.0000
:   0.0000
:   0.0067
:   0.0000
: [torch.FloatTensor of size 5]

- Not 1-indexed, which confused me for a little while.

*** Converting To and From Numpy

#+BEGIN_SRC python :session :results output
a = th.ones(5)
print(a)
#+END_SRC

#+RESULTS:
:
: 1
:  1
:  1
:  1
:  1
: [torch.FloatTensor of size 5]

: o

#+BEGIN_SRC python :session :results output
b = a.numpy()
print(b)
#+END_SRC

#+RESULTS:
:
: [ 1.  1.  1.  1.  1.]

#+BEGIN_SRC python :session
import numpy as np
a = np.ones(5)
b = th.from_numpy(a)
np.add(a, 1, out=a)
print(a)
print(b)
#+END_SRC

#+RESULTS:
| 2 | 2 | 2 | 2 | 2 |

** Autograd

#+BEGIN_SRC python :session
from torch.autograd import Variable
x = Variable(th.ones(2, 2), requires_grad=True)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session :results output
y = x + 2
print(y)
#+END_SRC

#+RESULTS:
:
: Variable containing:
:  3  3
:  3  3
: [torch.FloatTensor of size 2x2]

- *y* has a creator because it was created by an operation
#+BEGIN_SRC python :session :results output
print(y.creator)
#+END_SRC

#+RESULTS:
: <torch.autograd._functions.basic_ops.AddConstant object at 0x7f7eb12ed4c8>

#+BEGIN_SRC python :session
z = y * y * 3
out = z.mean()
print(z, out)
#+END_SRC

#+RESULTS:
: Variable containing:
:  27  27
:  27  27
: [torch.FloatTensor of size 2x2]

#+BEGIN_SRC python :session
out.backward(retain_variables=True)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session :results output
x = th.randn(3)
x = Variable(x, requires_grad=True)
y = x * 2
while y.data.norm() < 1000:
    y = y * 2

print(y)
#+END_SRC

#+RESULTS:
:
: >>> >>> ... ... >>> Variable containing:
: -1079.9720
:  -240.9234
:  -451.8607
: [torch.FloatTensor of size 3]

#+BEGIN_SRC python :session :results output
gradients = th.FloatTensor([0.1, 1.0, 0.0001])
y.backward(gradients)
print(x.grad)
#+END_SRC

#+RESULTS:
:
: >>> Variable containing:
:   51.2000
:  512.0000
:    0.0512
: [torch.FloatTensor of size 3]


#+BEGIN_SRC python :session :tangle net.py
import torch
from torch.autograd import Variable
import torch.nn as nn
import torch.nn.functional as F

class Net(nn.Module):


    def __init__(self):
        super(Net, self).__init__()
        #1 input channel, 6 output channels, 5*5 square convolution
        self.conv1 = nn.Conv2d(1, 6, 5)
        self.conv2 = nn.Conv2d(6, 16, 5)
        self.fc1 = nn.Linear(16*5*5, 120)
        self.fc2 = nn.Linear(120, 84)
        self.fc3 = nn.Linear(84, 10)


    def forward(self, x):
        #max pool over (2, 2) window
        x = F.max_pool2d(F.relu(self.conv1(x)), (2, 2))
        #if square mat then only specify a single number
        x = F.max_pool2d(F.relu(self.conv2(x)), 2)
        x = x.view(-1, self.num_flat_features(x))
        x = F.relu(self.fc1(x))
        x = F.relu(self.fc2(x))
        x = self.fc3(x)
        return x

    def num_flat_features(self, x):
        size = x.size()[1:] #everything except the batch dimension
        num_features = 1
        for s in size:
            num_features *= s
        return num_features


net = Net()
print(net)
#+END_SRC

#+RESULTS:

We can return the learnable parameters using the following

#+BEGIN_SRC python :session :results output
params = list(net.parameters())
print(len(params))
print(params[0].size())

#+END_SRC

#+RESULTS:
:
: 10
: torch.Size([6, 1, 5, 5])

- We input an autograd.Variable to forward, and it returns the same

#+BEGIN_SRC python :session :results output :tangle net.py
input = Variable(torch.randn(1, 1, 32, 32))
out = net(input)
print(out)
#+END_SRC

#+RESULTS:
#+begin_example

Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
  File "/usr/local/lib/python3.5/dist-packages/torch/nn/modules/module.py", line 202, in __call__
    result = self.forward(*input, **kwargs)
  File "/usr/local/lib/python3.5/dist-packages/torch/nn/modules/module.py", line 65, in forward
    raise NotImplementedError
NotImplementedError
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
NameError: name 'out' is not defined
#+end_example


- This is not working, let's try some test code to see if that works.

#+BEGIN_SRC python :session :tangle test.py
import torch
import torch.nn.functional as nn
import torch.autograd as autograd
import torch.optim as optim
import numpy as np
from torch.autograd import Variable


mnist = input_data.read_data_sets('../MNIST_data', one_hot=True)
mb_size = 64
Z_dim = 100
X_dim = mnist.train.images.shape[1]
y_dim = mnist.train.labels.shape[1]
h_dim = 128
lr = 1e-3


#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session :tangle testnet.py
from __future__ import print_function
import argparse
import torch
import torch.nn as nn
import torch.nn.functional as F
import torch.optim as optim
from torchvision import datasets, transforms
from torch.autograd import Variable
class Net(nn.Module):
    def __init__(self):
        super(Net, self).__init__()
        self.conv1 = nn.Conv2d(1, 10, kernel_size=5)
        self.conv2 = nn.Conv2d(10, 20, kernel_size=5)
        self.conv2_drop = nn.Dropout2d()
        self.fc1 = nn.Linear(320, 50)
        self.fc2 = nn.Linear(50, 10)

    def forward(self, x):
        x = F.relu(F.max_pool2d(self.conv1(x), 2))
        x = F.relu(F.max_pool2d(self.conv2_drop(self.conv2(x)), 2))
        x = x.view(-1, 320)
        x = F.relu(self.fc1(x))
        x = F.dropout(x, training=self.training)
        x = self.fc2(x)
        return F.log_softmax(x)

mod = Net()
print(mod)

#+END_SRC

#+RESULTS:


- To zero out buffers and backprops, use the following:

#+BEGIN_SRC python :session :results output
net.zero_grad()
out.backward(torch.randn(1,10))
#+END_SRC

#+RESULTS:
:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
: NameError: name 'out' is not defined

** Loading Data

The transfer learning tutorial ([[http://pytorch.org/tutorials/beginner/transfer_learning_tutorial.html][here]]) gives some sense of how to load data into pytorch.

- The folder structure is as follows

#+BEGIN_SRC sh :results output
ls hymenoptera_data
#+END_SRC

#+RESULTS:
: train
: val

- We can see that data is divided into train and test folders.

#+BEGIN_SRC sh :results output
ls hymenoptera_data/train
#+END_SRC

#+RESULTS:
: ants
: bees

- We can additionally see that the train/val folders are further subdivided into ants and bees (the classes to train against)

#+BEGIN_SRC sh :results output
ls hymenoptera_data/train/ants |head
#+END_SRC

#+RESULTS:
#+begin_example
0013035.jpg
1030023514_aad5c608f9.jpg
1095476100_3906d8afde.jpg
1099452230_d1949d3250.jpg
116570827_e9c126745d.jpg
1225872729_6f0856588f.jpg
1262877379_64fcada201.jpg
1269756697_0bce92cdab.jpg
1286984635_5119e80de1.jpg
132478121_2a430adea2.jpg
#+end_example

- And within each of these folders are the actual images to train against.

The data loading code itself is below.

#+BEGIN_SRC python :tangle load_data.py
import torch
import torch.nn as nn
import torch.optim as optim
from torch.autograd import Variable
import numpy as np
import torchvision
from torchvision import datasets, models, transforms
import matplotlib.pyplot as plt
import time
import copy
import os

data_transforms = {
    'train': transforms.Compose([
        transforms.RandomSizedCrop(224),
        transforms.RandomHorizontalFlip(),
        transforms.ToTensor(),
        transforms.Normalize([0.485, 0.456, 0.406], [0.229, 0.224, 0.225])

    ]),
    'val': transforms.Compose([
        transforms.Scale(256),
        transforms.CenterCrop(224),
        transforms.ToTensor(),
        transforms.Normalize([0.485, 0.456, 0.406], [0.229, 0.224, 0.225])

    ]),

}
data_dir = 'hymenoptera_data'
dsets = { x: datasets.ImageFolder(os.path.join(data_dir, x), x) for x in ['train', 'val']}

dset_loaders = {x: torch.utils.data.DataLoader(dsets[x], batch_size=4,
                                               shuffle=True, num_workers=4)
                for x in ['train', 'val']}
dset_sizes = {x: len(dsets[x]) for x in ['train', 'val']}
dset_classes = dsets['train'].classes
#+END_SRC



Ok, this code is pretty annoying and over-complicated.
Addendum: this code above actually does a lot more than the code in my examples below.

Most notably, its lazy which means that we read the images on demand, which facilitates the mini-batch style of programming that tends to be used with these models.
#+BEGIN_SRC python
from scipy import misc
test = misc.imread("new_photos/high/train/6813074_14131e6d689be42a008e3a288a42fcb3.jpg")
#+END_SRC

This does the job of creating a array from the image pixels.

#+BEGIN_SRC python :tangle load.py
from scipy import misc
import os as os
targets = ["low", "medium", "high"]
paths = []
for x in targets:
    paths.append(os.path.join("new_photos", x))
fullpath = []
imgs =[]
for x in paths:
    fullpath.append(os.path.join(x, "train"))

for each in fullpath:
    imglist = os.listdir(each)
    for img in imglist:
        try:
            imgs.append(misc.imread(os.path.join(each, img)))
        except Exception as e:
            pass



#+END_SRC

#+BEGIN_SRC python :tangle rent_pred.py
import torch
from torch.autograd import Variable
import torch.nn as nn
import torch.nn.functional as F
import torchvision.datasets as datasets
from torchvision import models, transforms
import os as os
from PIL import ImageFile
ImageFile.LOAD_TRUNCATED_IMAGES = True
transform = {
    'train': transforms.Compose([
        transforms.CenterCrop(128),
        transforms.ToTensor(),
        transforms.Normalize(
            (0.5, 0.5, 0.5),
            (0.5, 0.5, 0.5))]),
    'val': transforms.Compose([
        transforms.CenterCrop(128),
        transforms.ToTensor(),
        transforms.Normalize(
            (0.5, 0.5, 0.5),
            (0.5, 0.5, 0.5))])}


# data_transforms = {
    #     'train': transforms.Compose([
    #         transforms.RandomSizedCrop(224),
    #         transforms.RandomHorizontalFlip(),
    #         transforms.ToTensor(),
    #         transforms.Normalize([0.485, 0.456, 0.406], [0.229, 0.224, 0.225])
    #     ]),
    #     'val': transforms.Compose([
    #         transforms.Scale(256),
    #         transforms.CenterCrop(224),

    #         transforms.ToTensor(),
    #         transforms.Normalize([0.485, 0.456, 0.406], [0.229, 0.224, 0.225])
    #     ]),
    # }
data_dir = 'new_photos'
dsets = { x: datasets.ImageFolder(os.path.join(data_dir, x), transform[x]) for x in ['train', 'val']}

dset_loaders = {x: torch.utils.data.DataLoader(dsets[x], batch_size=6,
                                               shuffle=True, num_workers=4)
                                for x in ['train', 'val']}
dset_sizes = {x: len(dsets[x]) for x in ['train', 'val']}
dset_classes = dsets['train'].classes



#+END_SRC

#+BEGIN_SRC python :tangle rent_pred.py
class Net(nn.Module):
    def __init__(self):
        super(Net, self).__init__()
        self.conv1 = nn.Conv2d(3, 48, 5)
        self.pool = nn.MaxPool2d(2, 2)
        self.conv2 = nn.Conv2d(48, 64, 5)
        self.conv3 = nn.Dropout2d()
        self.fc1 = nn.Linear(64*29*29, 300)
        self.fc2 = nn.Linear(300, 120)
        self.fc3 = nn.Linear(120,3)

    def forward(self, x):
        x = self.pool(F.relu(self.conv1(x)))
        x = self.pool(F.relu(self.conv2(x)))
        x = x.view(-1, 64 * 29 * 29) #-1 ignores the minibatch
        x = F.dropout(x, training=self.training)
        x = F.relu(self.fc1(x))
        x = F.relu(self.fc2(x))
        x = self.fc3(x)
        return x

net = Net()
net.cuda()

#+END_SRC

#+BEGIN_SRC python
class Net(nn.Module):


    def __init__(self):
        super(Net, self).__init__()
        #1 input channel, 6 output channels, 5*5 square convolution
        self.conv1 = nn.Conv2d(3, 48, 5)
        self.conv2 = nn.Conv2d(48, 120, 5)
        self.fc1 = nn.Linear(120*5*5, 600)
        self.fc1 = nn.Dropout()
        self.fc2 = nn.Linear(600, 600)
        self.fc3 = nn.Linear(600, 3)


    def forward(self, x):
        #max pool over (2, 2) window
        x = F.max_pool2d(F.relu(self.conv1(x)), (2, 2))
        #if square mat then only specify a single number
        x = F.max_pool2d(F.relu(self.conv2(x)), 2)
        x = x.view(-1, self.num_flat_features(x))
        x = F.relu(self.fc1(x))
        x = F.relu(self.fc2(x))
        x = self.fc3(x)
        return x

    def num_flat_features(self, x):
        size = x.size()[1:] #everything except the batch dimension
        num_features = 1
        for s in size:
            num_features *= s
        return num_features


net = Net().cuda()
print(net)
#+END_SRC

** Neural Nets in Practice
- Minibatch size appears to be important
- Learnng rate is also important
- I need to read more of the Bengio book, as a lot of this appears to be covered


#+BEGIN_SRC python :tangle rent_pred.py
import torch.optim as optim
import datetime
criterion = nn.CrossEntropyLoss()
optimiser = optim.SGD(net.parameters(), lr=0.01, momentum=0.9)
phase = ['train', 'val']
tr = dset_loaders['train']
for epoch in range(10):
    running_loss = 0.0
    running_corrects = 0
    for i, data in enumerate(tr, 0):
        # get the inputs
        inputs, labels = data
        inputs, labels = Variable(inputs.cuda()), Variable(labels.cuda())
        optimiser.zero_grad()
        outputs = net(inputs)
        loss = criterion(outputs, labels)
        _, preds = torch.max(outputs.data, 1)
        loss.backward()
        optimiser.step()
        running_loss += loss.data[0]
        running_corrects += torch.sum(preds == labels.data)
    phase = 'train'
    epoch_loss = running_loss / dset_sizes['train']
    epoch_acc = running_corrects / dset_sizes['train']
    print('{} Loss: {:.4f} Acc: {:.4f}'.format(
                phase, epoch_loss, epoch_acc))
    dtime = str(datetime.datetime.now())
    outfilename = 'train' + "_" + str(epoch) +  "_" + dtime + ".tar"
    torch.save(net.state_dict(), outfilename)
print("Finished Training")
val = dset_loaders['val']
for epoch in range(5):
    val_loss = 0.0
    val_corrects = 0
    for i, data in enumerate(val, 0):
        inputs, labels = data
        inputs, labels = Variable(inputs.cuda()), Variable(labels.cuda())
        outputs = net(inputs)
        loss = criterion(outputs, labels)
        _, preds = torch.max(outputs.data, 1)
        val_loss += loss.data[0]
        val_corrects += torch.sum(preds == labels.data)
        phase = 'val'
    val_epoch_loss = val_loss / dset_sizes['val']
    val_epoch_acc = val_corrects / dset_sizes['val']
    print('{} Loss: {:.4f}  Acc: {:.4f}'.format(
            phase, val_epoch_loss, val_epoch_acc))
print("Finished validation set")
#+END_SRC

So, I was getting failures, so simplifying the problem to debug errors.
Still failures, even with the try block. I don't seem to be able to capture library errors (maybe I'm not using the right syntax?)
Anyway, the problem actually lies in the image files themselves, as there are some which have zero bytes (presumably failed downloads).
These need to be removed before I can use the model.

It's probably just easier to remove these in a separate script.

- So this now runs.

Unfortunately, it appears that it sucks as a neural net.
The loss is zig-zagging

loss is 0.7628176212310791
train Loss: 0.0001 Acc: 0.0006
loss is 0.9246833920478821
train Loss: 0.0001 Acc: 0.0005
loss is 0.556501567363739
train Loss: 0.0000 Acc: 0.0006
loss is 1.046607494354248
train Loss: 0.0001 Acc: 0.0004
loss is 0.8465149402618408
train Loss: 0.0001 Acc: 0.0005
Finished Training

- Yup, we can say that this sucks consistently.
- This is presumably because the images themselves are not particularly predictive
- Getting from pixels to interest is apparently difficult
- A number of approaches can be tried:
  - make the net deeper, add extra convolutions and layers
  - Use an LSTM to build models for each property (i.e. actually solve the kaggle problem)
  - Use the images with an autencoder to output features which can be used in a different model.

train Loss: 0.1612 Acc: 0.6744
loss is 1.6292909383773804
train Loss: 0.1355 Acc: 0.6750
loss is 0.8023977279663086
train Loss: 0.1353 Acc: 0.6750
loss is 0.820710301399231
train Loss: 0.1353 Acc: 0.6750
loss is 0.7990387678146362
train Loss: 0.1353 Acc: 0.6750
Finished Training

- OTOH, maybe I just wasn't calculating accuracy accurately ;)

- This is actually pretty reasonable

- The real test is how it does on the validation data, however.

#+BEGIN_SRC sh :eval no
python rend_pred.py
#+END_SRC

#+RESULTS:
train Loss: 0.1589 Acc: 0.6720
train Loss: 0.1354 Acc: 0.6750
train Loss: 0.1353 Acc: 0.6750
train Loss: 0.1352 Acc: 0.6750
train Loss: 0.1353 Acc: 0.6750
Finished Training
val Loss: 0.0002  Acc: 0.0000
val Loss: 0.0001  Acc: 0.0002
val Loss: 0.0001  Acc: 0.0002
val Loss: 0.0004  Acc: 0.0000
val Loss: 0.0002  Acc: 0.0000
Finished validation set


- So maybe it does suck, or maybe I'm just not running the predictions correctly
- I probably need to save the model and interrogate it later




#+BEGIN_SRC python
data_dir = 'new_photos'
empty =[]
files = [file for file in glob.glob(data_dir + '/**/*.jpg', recursive=True)]
for myfile in files:
     if os.path.isfile(myfile):
                if os.path.getsize(myfile)==0:
                    empty.append(myfile)

for emptyfile in empty:
    os.remove(emptyfile)
#+END_SRC

This was actually pretty easy, at least once I found out that recursive globbing has been added in Python3.5, which at least jusitfies my use of it.

#+BEGIN_SRC python
import torch.optim as optim
criterion = nn.CrossEntropyLoss()
optimiser = optim.SGD(model.parameters(), lr=0.001, momentum=0.9)
num_epochs = 25

for epoch in range(num_epochs):
        print('Epoch {}/{}'.format(epoch, num_epochs - 1))
        print('-' * 10)

        # Each epoch has a training and validation phase
        for phase in ['train', 'val']:
            if phase == 'train':
                model.train(True)  # Set model to training mode
            else:
                model.train(False)  # Set model to evaluate mode

            running_loss = 0.0
            running_corrects = 0

            # Iterate over data.
            print(phase)
            for data in dset_loaders[phase]:

                # get the inputs
                inputs, labels = data

                # wrap them in Variable
                if use_gpu:
                    inputs, labels = Variable(inputs.cuda()), \
                        Variable(labels.cuda())
                else:
                    inputs, labels = Variable(inputs), Variable(labels)

                # zero the parameter gradients
                optimizer.zero_grad()

                # forward
                outputs = model(inputs)
                _, preds = torch.max(outputs.data, 1)
                loss = criterion(outputs, labels)

                # backward + optimize only if in training phase
                if phase == 'train':
                    loss.backward()
                    optimizer.step()

                # statistics
                running_loss += loss.data[0]
                running_corrects += torch.sum(preds == labels.data)

            epoch_loss = running_loss / dset_sizes[phase]
            epoch_acc = running_corrects / dset_sizes[phase]

            print('{} Loss: {:.4f} Acc: {:.4f}'.format(
                phase, epoch_loss, epoch_acc))

            # deep copy the model
            if phase == 'val' and epoch_acc > best_acc:
                best_acc = epoch_acc
                best_model = copy.deepcopy(model)

        print()

        time_elapsed = time.time() - since
        print('Training complete in {:.0f}m {:.0f}s'.format(
                time_elapsed // 60, time_elapsed % 60))
        print('Best val Acc: {:4f}'.format(best_acc))
        torch.save()
#+END_SRC


#+BEGIN_SRC python
import torch.utils.data as data_utils

train = data_utils.TensorDataset(features, targets)
train_loader = data_utils.DataLoader(train, batch_size=50, shuffle=True)
#+END_SRC

#+BEGIN_SRC python :tangle load_data.py
def imshow(inp, title=None):
    """Imshow for Tensor"""
    inp = inp.numpy().transpose((1, 2, 0))
    mean = np.array([0.485, .457, 0.406])
    std = np.array([0.229,0.224, 0.225])
    inp = std * inp + mean
    plt.imshow(inp)
    if title is not None:
        plt.title(title)
    plt.pause(10)

inputs, classes = next(iter(dset_loaders['train']))

out = torchvision.utils.make_grid(inputs)

imshow(out, title=[dset_classes[x] for x in classes])
#+END_SRC

So, the next step is to arrange my data into the form that torch requires.
- To do this, I need a mapping from listing id to interest level.
- Each image was output in the following manner <listing_id>-i.jpg where i is the number of images processed (from 1, including the current) for the current listing.

#+BEGIN_SRC R :session
require(dplyr)
int_level_listing_id <- select(sample_for_photos, listing_id, interest_level)
images <- list.files("photos_sample/")
img_listings <- unique(gsub("-[0-9]+.jpg", "", x=images))
rental_images <- filter(sample_for_photos, listing_id %in% as.integer(img_listings))
move_photo_to_folder <- function(data, dir, target, prop_train=0.7) {
    trainval <- c("train", "val")
    base_folder_names <- unique(data[[target]])
    data[,"traintest"] <- runif(n=nrow(data))
    for(i in 1:nrow(data)) {
        listing <- unlist(data [i,"listing_id"])
        impresent <- list.files(path=dir, pattern=as.character(listing))
        print(length(impresent))
        lev <- unlist(data [i,target])
        if(data$traintest>=0.7) {
                        path <- paste0("val", "/", lev, "/"   )
        }

    }

}
#+END_SRC

#+RESULTS:
- So, I an the code above on and off for around 2 days (from Wed-Fri)
- I had terrible internet connection, and used my phone
- I got 19K images from my 5k listings which is definitely enough to start playing with PyTorch in anger.


